test/Lagrangian/coupling/0/Lagrangian/kinematicParcel/number
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       LagrangianScalarField;
    location    "0/Lagrangian/kinematicParcel";
    object      number;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [];

internalField   uniform 1;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    ".*"
    {
        type            calculated;
    }
}

sources
{
    pointInjection
    {
        type            flowRateNumber;
        uniformSize     volume;
        volumetricFlowRate 7 [ml/s];
    }
}


// ************************************************************************* //
