test/Lagrangian/coupling/system/Lagrangian/kinematicParcel/LagrangianSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system/Lagrangian/kinematicParcel";
    object      LagrangianSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

outerCorrectors yes;

maxTimeStepFraction 0.3;

maxCellLengthScaleFraction 0.3;

nCorrectors     1;


// ************************************************************************* //
